# Chap9 과제

### 6.
X=c(18,13,18,15,10,12,8,4,7,3)
Y=c(23,20,18,16,14,11,10,7,6,4)
plot(X,Y)


### 7.
X=c(10,5.5,9,9,8,12.6,3,11,6.5,6.5,6,6.6,2.7,6,5.4,6,3.3)
Y=c(600,625,560,585,590,500,700,570,540,785,765,611,600,625,650,635,522)
## 1) 결정계수 추정
data=data.frame(X,Y)
reg=lm(Y~X,data)
summary(reg)
## 2) F-검정
df=length(X)-2 # 15
# 결정규칙
df(0.975,df1=1,df2=df) # 0.2410155
# 검정통계량
anova(reg) # F-value=2.5265
# 검정통계량=2.52>결정규칙=0.24이므로 기각역 포함
# 따라서, 영가설 기각 = 선형성 존재
## 3) t-검정
# 결정규칙
qt(0.975,df) # 2.109816
# 검정통계량
beta_hat=-10.603 # 추정량
var_beta=6.671 # 추정치의 표준오차
t=beta_hat/var_beta; t # -1.589417
# 검정통계량=-1.589417>결정규칙=-2.109816이므로 기각역 포함되지 않음
# 따라서, 영가설 채택 = 선형성 존재하지 않음
## 4)
beta_hat=-10.603 # 추정량
var_beta=6.671 # 추정치의 표준오차
# 하한값
beta_hat-qt(0.975,df)*var_beta # -24.8219
# 상한값
beta_hat+qt(0.975,df)*var_beta # 3.6159
# confint 함수
confint(reg)


### 8.
st=c(28,46,39,25,34,29,38,23,42,27,35,39,38,32,25)
height=c(146,169,160,156,161,168,154,153,160,152,155,154,157,162,142)
weight=c(34,57,48,38,47,50,54,40,62,39,46,54,57,53,32)
leng=c(22,36,24,22,27,29,26,23,31,24,23,27,31,25,23)
stu2=data.frame(st,height,weight,leng)
# 1) 악력
st_reg=lm(leng~st,stu2)
summary(st_reg)
# 2) 신장
he_reg=lm(leng~height,stu2)
summary(he_reg)
# 3) 체중
we_reg=lm(leng~weight,stu2)
summary(we_reg)


### 9.
enum=c(30,35,40,45,50,55,60,70,75,80,65)
eprice=c(1.15,1.1,0.98,1.01,0.97,0.9,0.89,0.85,0.78,0.7,0.8)
e=data.frame(enum,eprice)
## 1) 결정계수 추정
e_reg=lm(eprice~enum,e)
summary(e_reg)
## 2) 분산분석표 및 F통계량 검정
df=length(enum)-2; df
# 결정규칙
df(0.975,df1=1,df2=df) # 0.2349722
# F-통계량
anova(e_reg) # 152.42
## 3) p-value
# anova(e_reg) 결과, p-value=6.043e-07 ***
## 4) 결과 해석
# 검정통계량=152.42>결정규칙=0.23이므로 기각역 포함
# 따라서, 영가설 기각 = 선형성 존재 
## 5) 신뢰구간
# confint 함수
confint(e_reg)


### 10.
eat=c(180,200,230,410,600,550,275,580,105,250,460,650)
Ag=c(90,120,125,290,310,290,170,375,70,105,205,480)
mean(Ag)
fish=data.frame(eat,Ag)
## 1)
fi_reg=lm(Ag~eat,fish); fi_reg
summary(fi_reg)
## 2)
## F-검정
df=length(eat)-2; df # 10
# 결정규칙
df(0.975,df1=1,df2=df) # 0.2362345
# 검정통계량
anova(fi_reg) # F-value=75.531 
# 검정통계량=75.531>결정규칙=0.24이므로 기각역 포함
# 따라서, 영가설 기각 = 선형성 존재
## t-검정
# 결정규칙
qt(0.975,df) # 2.228139
# 검정통계량
beta_hat=0.64 # 추정량
var_beta=0.07373 # 추정치의 표준오차
t=beta_hat/var_beta; t # 8.68032
# 검정통계량=8.68>결정규칙=2.23이므로 기각역 포함
# 따라서, 영가설 기각 = 선형성 존재
